//--------------------------------------------------------------------
// arrayalert.mq4 
// Предназначен для использования в качестве примера в учебнике MQL4.
//--------------------------------------------------------------------
int start()                                     // Спец. функция start
  {
   string Mas_s[4]={"a","b", ,"d"};             // Строковый массив
   int Mas_i[6]={ 0,1,2, ,4,5 };                // Массив целого типа
   Alert(Mas_s[0],Mas_s[1],Mas_s[2],Mas_s[3]);  // Вывод на экран
   Alert(Mas_i[0],Mas_i[1],Mas_i[2],Mas_i[3],Mas_i[4],Mas_i[5]);
   return;                                      // Выход из start()
  }
//--------------------------------------------------------------------