//--------------------------------------------------------------------
// countticks.mq4
// Предназначен для использования в качестве примера в учебнике MQL4.
//--------------------------------------------------------------------
int Tick;                              // Глобальная переменная
//--------------------------------------------------------------------
int start()                            // Специальная функция start()
  {
   Tick++;                             // Счётчик тиков
   Comment("Поступил тик № ",Tick);    // Сообщение, содержащее номер
   return;                             // Оператор выхода из start()
  }
//--------------------------------------------------------------------