//--------------------------------------------------------------------
// predefined.mq4
// Предназначен для использования в качестве примера в учебнике MQL4.
//--------------------------------------------------------------------
int start()                                     // Спец. функция start
  {
   Alert("Bid = ", Bid);                        // Текущий курс
   return;                                      // Выход из start()
  }
//--------------------------------------------------------------------