//--------------------------------------------------------------------
// pricealert.mq4
// Предназначен для использования в качестве примера в учебнике MQL4.
//--------------------------------------------------------------------
int start()                                     // Спец. функция start
  {
   double Level=1.3200;                         // Задан. уровень цены
   int Delta=NormalizeDouble((Bid-Level)/Point,0);// Превышение 
   if (Delta<=0)                                // Цена не выше уровня
     {
      Alert("Цена ниже уровня");                // Сообщение
      return;                                   // Выход из start()
     }
//--------------------------------------------------------------------
   switch(Delta)                                // Заголовок switch
     {                                          // Начало тела switch
      case 1 : Alert("Плюс один пункт");    break;// Варианты..
      case 2 : Alert("Плюс два пункта");    break;
      case 3 : Alert("Плюс три пункта");    break;
      case 4 : Alert("Плюс четыре пункта"); break;//Здесь представлено
      case 5 : Alert("Плюс пять пунктов");  break;//10 вариантов case,
      case 6 : Alert("Плюс шесть пунктов"); break;//но в общем случае
      case 7 : Alert("Плюс семь пунктов");  break;//количество case
      case 8 : Alert("Плюс восемь пунктов");break;//не ограничено
      case 9 : Alert("Плюс девять пунктов");break;
      case 10: Alert("Плюс десять пунктов");break;
      default: Alert("Более десяти пунктов");   // С case не совпало
     }                                          // Конец тела switch
//--------------------------------------------------------------------
   return;                                      // Выход из start()
  }
//--------------------------------------------------------------------