//--------------------------------------------------------------------
// barnumber.mq4
// Предназначен для использования в качестве примера в учебнике MQL4.
//--------------------------------------------------------------------
int start()                             // Специальная функция start()
  {
   int n = 3;                           // Заданный номер
   Alert("Номера баров, начиная с ", n,":");// Не зависит от n 
//--------------------------------------------------------------------
   switch (n)                           // Заголовок оператора switch
     {                                  // Начало тела switch
      case 1 : Alert("Бар 1");          // Варианты..
      case 2 : Alert("Бар 2");    
      case 3 : Alert("Бар 3");    
      case 4 : Alert("Бар 4");          // Здесь представлено 10 ..
      case 5 : Alert("Бар 5");          // ..вариантов case, но в ..
      case 6 : Alert("Бар 6");          // ..общем случае количество..
      case 7 : Alert("Бар 7");          // ..case не ограничено  
      case 8 : Alert("Бар 8");
      case 9 : Alert("Бар 9");
      case 10: Alert("Бар 10");break;    
      default: Alert("Задан неправильный номер");// С case не совпало
     }                                  // Конец тела switch
//--------------------------------------------------------------------
   return;                              // Оператор выхода из start()
  }
//--------------------------------------------------------------------