//--------------------------------------------------------------------
// bigbars.mq4
// Предназначен для использования в качестве примера в учебнике MQL4.
//--------------------------------------------------------------- 1 --
extern int Quant_Pt=20;                // Количество пунктов
//--------------------------------------------------------------- 2 --
int start()                            // Спец. функция start
  {
   int H_L=0;                          // Высота бара
   for(int i=0; H_L<Quant_Pt; i++)     // Цикл по барам
     {
      H_L=MathAbs(High[i]-Low[i])/Point;//Высота бара
      if (H_L>=Quant_Pt)               // Если найден высокий бар
        {
         int YY=TimeYear(  Time[i]);   // Год
         int MN=TimeMonth( Time[i]);   // Месяц         
         int DD=TimeDay(   Time[i]);   // День
         int HH=TimeHour(  Time[i]);   // Час         
         int MM=TimeMinute(Time[i]);   // Минута
         Comment("Последнее движение цены более ",Quant_Pt,//Вывод
         " pt произошло ", DD,".",MN,".",YY," ",HH,":",MM);//сообщения
        }
     }
   return;                             // Выход из start()
  }
//--------------------------------------------------------------- 3 --