//--------------------------------------------------------------------
// callindicator.mq4
// Предназначен для использования в качестве примера в учебнике MQL4.
//--------------------------------------------------------------------
//--------------------------------------------------------------------
extern int Period_MA=5;             // Период расчётной МА
bool Fact_Up=true;                  // Факт сообщения, что цена..
bool Fact_Dn=true;                  //..находится выше или ниже МА
//--------------------------------------------------------------------
int start()                           // Спец. функция start
  {
   double MA;                         // Значение МА на 0 баре    
//--------------------------------------------------------------------
   // Обращение к функции техн.инд.
   MA=iMA(NULL,0,Period_MA,0,MODE_SMA,PRICE_CLOSE,0);
//--------------------------------------------------------------------
   if (Bid > MA && Fact_Up==true)   // Проверка прохода вверх
     {
      Fact_Dn=true;                 // Сообщать о цене выше МА
      Fact_Up=false;                // Не сообщать о цене ниже МА
      Alert("Цена находится выше MA(",Period_MA,").");// Сообщение 
     }
//--------------------------------------------------------------------
   if (Bid < MA && Fact_Dn==true)   // Проверка прохода вниз
     {
      Fact_Up=true;                 // Сообщать о цене ниже МА
      Fact_Dn=false;                // Не сообщать о цене выше МА
      Alert("Цена находится ниже MA(",Period_MA,").");// Сообщение 
     }
//--------------------------------------------------------------------
   return;                            // Выход из start()
  }
//--------------------------------------------------------------------