//--------------------------------------------------------------------
// Create.mq4
// Предназначен для использования в качестве примера в учебнике MQL4.
//--------------------------------------------------------------------
int Count=0;                                    // Глобальная перемен.
//--------------------------------------------------------------------
int init()                                      // Спец. ф-ия init()
  {
   Alert ("Сработала ф-ия init() при запуске"); // Сообщение
   return;                                      // Выход из init()
  }
//--------------------------------------------------------------------
int start()                                     // Спец. ф-ия start()
  {
   double Price=Bid;                            // Локальная перемен.
   Count++;                                     // Счётчик тиков
   Alert("Новый тик ",Count,"   Цена = ",Price);// Сообщение
   return;                                      // Выход из start()
  }
//--------------------------------------------------------------------
int deinit()                                    // Спец. ф-ия deinit()
  {
   Alert ("Сработала ф-ия deinit() при выгрузке");   // Сообщение
   return;                                      // Выход из deinit()
  }
//--------------------------------------------------------------------