//--------------------------------------------------------------------
// externvar.mq4
// Предназначен для использования в качестве примера в учебнике MQL4.
//--------------------------------------------------------------------
extern double Level=1.2500;                     // Внешняя переменная
extern int        n=5;                          // Внешняя переменная
       bool  Fact_1=false;                      // Глобальная перемен.
       bool  Fact_2=false;                      // Глобальная перемен.
//--------------------------------------------------------------------
int start()                                     // Спец. функция start
  {
   double Price=Bid;                            // Локальная перемен.
   if (Fact_2==true)                            // Если сообщение уже..
      return;                                   // ..было, то выходим

   if (NormalizeDouble(Price,Digits)>=NormalizeDouble(Level,Digits))
      Fact_1=true;                              // Произошло событие 1

   if (Fact_1==true && NormalizeDouble(Price,Digits)<=
                         NormalizeDouble(Level-n*Point,Digits))

      My_Alert();                               // Вызов польз. ф-ии
   return;                                      // Выход из start()
  }
//--------------------------------------------------------------------
void My_Alert()                                 // Пользовательс. ф-ия
  {
   Alert("Условия достигнуты");                 // Сообщение
   Fact_2=true;                                 // Произошло событие 2
   return;                                      // Выход из польз.ф-ии
  }
//--------------------------------------------------------------------