//--------------------------------------------------------------------
// historybars.mq4
// Предназначен для использования в качестве примера в учебнике MQL4.
//--------------------------------------------------------------------
extern int Period_MA=5;             // Период расчётной МА
//--------------------------------------------------------------------
int start()                           // Спец. функция start
  {
   double MA_c,                       // Значение МА на 0 баре    
   MA_p,                       // Значение МА на 4 баре    
   Delta;                      // Разница МА на 0 и 4 баре
//--------------------------------------------------------------------
   // Обращение к функции техн.инд.
   MA_c =iMA(NULL,0,Period_MA,0,MODE_SMA,PRICE_CLOSE,0);
   MA_p =iMA(NULL,0,Period_MA,0,MODE_SMA,PRICE_CLOSE,4);
   Delta=(MA_c - MA_p)/Point;       // Разница МА на 0 и 4 баре
//--------------------------------------------------------------------
   if (Delta > 0)                   // Текущая цена больше старой
      Alert("На 4 барах МА выросла на ",Delta,"pt");  // Сообщение 
   if (Delta < 0)                   // Текущая цена меньше старой
      Alert("На 4 барах МА снизилась на ",-Delta,"pt");// Сообщение 
//--------------------------------------------------------------------
   return;                            // Выход из start()
  }
//--------------------------------------------------------------------