//--------------------------------------------------------------------
// onelevel.mq4
// Предназначен для использования в качестве примера в учебнике MQL4.
//--------------------------------------------------------------------
int start()                                   // Спец. функция start
  {
   double
   Level,                                     // Сигнальный уровень
   Price;                                     // Текущая цена
   Level=1.2753;                              // Задаём уровень
   Price=Bid;                                 // Запрашиваем цену
//--------------------------------------------------------------------
   if (Price>Level)                           // Оператор if с условием
     {
      Alert("Курс превысил заданный уровень");// Сообщение трейдеру
     }
//--------------------------------------------------------------------
   return;                                    // Выход из start()
  }
//--------------------------------------------------------------------