//--------------------------------------------------------------------
// sheep.mq4
// Предназначен для использования в качестве примера в учебнике MQL4.
//--------------------------------------------------------------------
int start()                               // Специальная ф-ия start()
  {
//--------------------------------------------------------------------
   int
   day,                                   // Текущий день месяца
   Mons;                                  // Искомое количест. месяцев
   double
   One_Farm    =1000.0,                   // Количество на 1 ферме
   Perc_day    =1,                        // Ежедневный подъём, %
   One_Farm_max=50000.0,                  // Пороговое значение
   Perc_exit   =10,                       // Ежемесячный вывод, %
   Purpose     =35000.0,                  // Необх. колич. на 2 ферме
   Two_Farm;                              // Количество на 2 ферме
//--------------------------------------------------------------------
   while(Two_Farm < Purpose)              // Внешний цикл по истории
     {                                    // Начало тела внешн. цикла
      //--------------------------------------------------------------
      for(day=1; day<=30; day++)          // Цикл по дням месяца
         One_Farm=One_Farm*(1+Perc_day/100);//Накопление на 1й ферме
      //--------------------------------------------------------------
      Mons++;                             // Считаем месяцы
      if (One_Farm < One_Farm_max)        // Если меньше допустимого,.
         continue;                        // .. то овец не переводим
      Two_Farm=Two_Farm+One_Farm*Perc_exit/100;//Количес. на 2 ферме
      One_Farm=One_Farm*(1-Perc_exit/100);// Остаток на 1 ферме
     }                                    // Конец тела внешнего цикла
//--------------------------------------------------------------------
   Alert("Цель будет достигнута через ",Mons," мес.");//Вывод на экран
   return;                                // Выход из функции start()
  }
//--------------------------------------------------------------------